{
  "name" : "3397271.3401103.pdf",
  "metadata" : {
    "source" : "META",
    "title" : "An Eye Tracking Study of Web Search by People With and Without Dyslexia",
    "authors" : [ "Srishti Palani", "Adam Fourney", "Shane Williams", "Kevin Larson", "Irina Spiridonova", "Meredith Ringel Morris", "Irina Spiri" ],
    "emails" : [ "srpalani@ucsd.edu", "adamfo@microsoft.com", "shanewil@microsoft.com", "kevlar@microsoft.com", "irinasp@microsoft.com", "merrie@microsoft.com" ],
    "sections" : [ {
      "heading" : null,
      "text" : "CCS CONCEPTS · Information systems → Search interfaces; · Human-centered computing → Empirical studies in accessibility.\nKEYWORDS Web search; Information Retrieval; Dyslexia; Eye tracking\nACM Reference Format: Srishti Palani, Adam Fourney, Shane Williams, Kevin Larson, Irina Spiridonova, and Meredith Ringel Morris. 2020. An Eye Tracking Study of Web Search by People With and Without Dyslexia. In 43rd International ACM SIGIR Conference on Research and Development in Information Retrieval (SIGIR ’20), July 25ś30, 2020, Virtual Event, China. ACM, New York, NY, USA, 10 pages. https://doi.org/10.1145/3397271.3401103"
    }, {
      "heading" : "1 INTRODUCTION",
      "text" : "Dyslexia is a cognitive diference that impacts about 15% of English speakers [7] (incidence rates vary by language [30]). People with dyslexia tend to experience challenges in tasks involving reading, writing, spelling, and memory, despite having normal intelligence. These challenges often manifest in a slower reading rate and lower reading comprehension [35]. However, because dyslexia is a spectrum disorder, diferent people may experience diferent subsets and degrees of symptoms [7].\nPermission to make digital or hard copies of part or all of this work for personal or classroom use is granted without fee provided that copies are not made or distributed for proft or commercial advantage and that copies bear this notice and the full citation on the frst page. Copyrights for third-party components of this work must be honored. For all other uses, contact the owner/author(s). SIGIR ’20, July 25ś30, 2020, Virtual Event, China © 2020 Copyright held by the owner/author(s). ACM ISBN 978-1-4503-8016-4/20/07. https://doi.org/10.1145/3397271.3401103\nRelatively little is known about how dyslexia impacts web search, but several recent studies have begun to shed some light on this topic. Interviews with people with dyslexia suggest that search engine use - including query formulation, search result triage and information extraction from target webpages - is particularly challenging for this population [4, 19, 35, 37, 43]. Online experiments comparing search behaviors of people with and without dyslexia have identifed some features of webpages, such as average line length and the ratio of images to text, that impact page readability for people with dyslexia [25].\nIn this paper, we build on this knowledge by conducting an eye tracking study to investigate the following research questions: RQ1: Are there any diferences between gaze patterns of searchers with and without dyslexia? RQ2: What does the gaze data reveal about the challenges experienced and strategies employed by these two searcher groups?\nTo address these research questions, we conducted an eye tracking study with 27 participants (14 with dyslexia, 13 control). Each participant completed 6 informational search tasks using a modern, English-language, interactive search engine. Our analysis of eye tracking data, together with participants’ self-reports about their experiences, extend fndings from prior studies and contribute new insight into the diferences in search behavior between people with and without dyslexia. Our fndings validate prior self-report fndings that Searchers with Dyslexia (SWD) struggle with all stages of the search process: query formulation, search results triage, and information extraction [37, 43]. Adding to prior work, we fnd SWD visually attend to pages in a markedly diferent fxation pattern\nthan searchers without dyslexia (for e.g. see Figure 1). We conclude the paper by discussing the design implications of our fndings to improve cognitive accessibility of search for people with dyslexia."
    }, {
      "heading" : "2 RELATED WORK",
      "text" : "This research builds on prior work done to capture and understand search behavior, and on studies of searchers with dyslexia."
    }, {
      "heading" : "2.1 Methods for Understanding Web Search",
      "text" : "Researchers in information retrieval and HCI have extensively studied user interaction with web search systems, particularly for complex informational [16] or exploratory [55] search tasks. Such tasks typically comprise three stages [3, 43]: query formulation (i.e., generating and refning search keywords), search results triage (i.e., determining which parts of the search engine results page ś the SERP ś are most relevant to the task at hand, and which link to open), and information extraction (i.e., gathering and making sense of the sought-after content). In this study, we gather data about this complete query-triage-extraction search pipeline for searchers with and without dyslexia.\nResearchers have employed a variety of methods to study web search, including analyzing search engine and web browser logs (e.g., [32, 53, 54]), gathering self-report data from surveys, interviews, or diary studies of end-users (e.g., [42, 43]), and recruiting participants to perform controlled search tasks (e.g., [3, 25, 44]). As with any methodology, there are trade-ofs: logs can provide in-situ data for a large set of users, but lack qualitative depth; self-report data may have gaps or inconsistencies with actual observed behavior; controlled, in-lab task performance may difer from natural search behavior in unanticipated ways, etc. Several researchers have begun to use eye tracking to understand which aspects of the SERP users attend to [22, 23, 36, 52]. Eye tracking allows us to log and track the amount of attention paid to specifc parts of the pages and interactions at a granular level of space and time. For example, eye tracking studies have revealed that searchers usually fxate on SERPs and webpages in an F-shape pattern [45, 46]. These studies have also shown that searchers distribute their visual attention diferently across organic and ad results on a SERP [24], and that one can determine a webpage’s most salient parts by looking at the amount of visual attention paid to its diferent elements [17]. This paper builds on prior eye-tracking studies to understand how diferent searchers attend to diferent elements of SERPs and webpages. We complement our eye tracking data with participants’ comments immediately after searching to gain qualitative insight into the meaning of the eye tracking results."
    }, {
      "heading" : "2.2 Dyslexia and Web Search",
      "text" : "In this section, we discuss prior work on challenges faced by searchers with dyslexia (SWD) at each stage of the search process.\n2.2.1 Qery Formulation: Since spelling and query formulation are closely related, this stage of search has been reported to be challenging for those with dyslexia. From their interview study, Morris et al. [43] reported SWD have trouble spelling words at the phonetic level. They also found SWD report a heavy reliance on voice input and on autocomplete when forming queries. In 2015, Berget and Sandness [13] compared search logs of 21 students with\nand 21 without dyslexia who had formulated Norwegian queries for a Norwegian academic library system with no query-formulation aids. They found that SWD took longer to search, possibly because of spelling errors in their queries. Consequently, they also issued more queries overall. In their 2016 qualitative study, Cole et al. [19] confrmed these fndings for English queries in a system without any query formulation aids. They reported that SWD found choosing keywords, spelling, and forming/refning complex queries using Boolean search strategies of AND and OR operators to be more challenging than a control group. However, in 2016, Berget and Sandness [14] found that when SWD used Google, a modern interactive search engine with query formulation aids, for formulating Norwegian queries, there were no diferences in query formulation behavior. This suggests query formulation aids could help those with dyslexia. Through our eye-tracking study, we validate these self-report results for a modern interactive English-language search engine with query-formulation aids.\n2.2.2 Search Results Triage: In 2010, MacFarlane et al. [37] conducted a search log analysis of people with dyslexia interacting with an information retrieval interface (Okapi), and found SWD read fewer documents on average, had fewer search interactions, and took more time to complete searching. Concluding their article, they state the need for a more granular approach to understand search behavior diferences between searchers with and without dyslexia than search log analysis.\nFurthermore, prior work suggests a strong correlation between dyslexia and lower phonological working memory (i.e., the ability to hold words in short-term memory) [10, 38]. Work done to investigate the efects of working memory on search results triage echoes MacFarlane et al.’s fndings. In 2019, a search log study of participants with low and high working memory found that those with lower working memory take more time to frst click on the SERP, open fewer links, and take more time between events [18].\n2.2.3 Information Extraction: In 2007, Al-Wabil et al.’s [4] interview study observing searchers with dyslexia navigate multiple pages within a website found navigational trails (such as site maps, back and forward buttons) and menus helped SWD locate where they were within a site. Similarly, in 2008, an eye tracking study by Al-Wabil et al. [5], observed 7 participants (2 with dyslexia and 5 controls) navigate webpages within 6 websites to extract information. They found SWD took longer to complete the tasks, had more fxations on the page, looked at the page for longer, and their scan paths were markedly diferent than the control group. A follow-up analysis reported SWD changed scan direction more on the webpage than the control group [39]. They suggest this is an indication of short term memory problems and adds to prior research on backtracking [4]. However, the small number of participants (2 SWD) makes it hard to extrapolate defnitive quantitative diferences from these results.\nIn 2018 Fourney et al. [25] found SWD’s relevance ratings of webpages were highly correlated with their readability scores. They identifed several visual and textual features such as line length, number of headings, and ratio of images to text, that impact SWDs’ readability and relevance judgements of webpages. In 2019, Li et al. [35] found using the \"Reader View\" mode in Firefox web browser,\nwhich simplifes a page’s visual structure, improved reading speed for SWD without reducing comprehension.\nOur study builds on these prior eforts by capturing eye gaze patterns of 27 participants (14 SWD, 13 control) using a modern, English-language, interactive search engine during the complete query-triage-extraction search pipeline."
    }, {
      "heading" : "3 METHOD",
      "text" : "Our primary research question asks if there are diferences between gaze patterns and search behavior of searchers with and without dyslexia. To answer this question we designed a study that collects search log, eye tracking, and self-report data through all three stages of search: formulating queries, triaging search results, and extracting information from the resultant pages."
    }, {
      "heading" : "3.1 Participants",
      "text" : "We recruited participants using paid social media ads targeted towards residents of our (anonmyized, US-based) metropolitan area, who followed the #dyslexia hashtag or any of a set of organizations related to dyslexia, including a local special-education secondary school. As gratuity for participating in the hour-long study, participants received a $50 Amazon.com gift card. The study took place over a three-week period in the summer of 2019.\nWe recruited 32 participants, half of whom had a medical diagnosis of dyslexia. However, eye tracking data could not be reliably collected for 5 participants: in 4 cases this was due to a malfunction of the instrumentation, and in 1 case tracking failed because the participant had an eye condition (amblyopia). These 5 participants are removed from further consideration, leaving 27 total participants: 14 searchers with dyslexia (SWD), and 13 searchers in the control group.\nParticipants’ ages ranged from 13-72 years (x =27.3, ˙ =17.3). 12 participants were between the ages 13-17 (and received parental permission to participate), and 15 participants were 18 or older. Participants with and without dyslexia were well-balanced across age groups with 7 teenagers with dyslexia and 6 without, and 7 adults with dyslexia and 7 without. One adult reported having attention defcit hyperactivity disorder (ADHD) in addition to dyslexia. ADHD, a neurological diference that is characterized by difculty focusing, is a common comorbidity that occurs with dyslexia [26]. Of the 27 participants, 20 reported using web search engines multiple times on the average day, 5 reported using search at least once per day, and 2 reported searching multiple times per week. When asked to rate their search expertise, 8 participants self-rated as expert searchers, 17 as intermediate, and 2 as novice. Adult participants had a diverse set of occupations, including: program managers, designers, engineers, analysts, a school superintendent, and a human-resources director. Teen participants were all enrolled in secondary school.\n9 participants were male and 18 were female. In the general population, the gender ratio for dyslexia is typically near parity, or skewed slightly towards males [29]. Within our sample, 5 participants with dyslexia identifed as male, while 9 identifed as female. In the control group, 4 participants identifed as male and 9 identifed as female. This gender skew likely refects a limitation of our recruitment methods ś women are more likely to use social media, follow mailing lists [27], and be special education teachers [2], so\nmay have been more likely to see our ads. Lastly, all participants were fuent or native English speakers."
    }, {
      "heading" : "3.2 Apparatus",
      "text" : "We conducted the study on a 17ž LCD monitor, positioned at desklevel approximately 28ž from the participant’s eyes. This distance and head position were weakly enforced by seating participants in a four-legged chair, and then marking the location of each chair leg on the foor with tape. We used the monitor’s native resolution of 1920 × 1200 pixels, and accepted the operating system’s default display scaling of 150%. With this display setting, three or four search results were visible on the screen before scrolling. Participants could scroll pages freely, but could not adjust the scaling or browser zoom factors. Together, these controls ensured a consistent visual experience for all participants.\nWe used the Tobii 4c eye tracker [http://www.tobii.se/] upgraded with the Tobii Pro SDK to record each participant’s gaze patterns as they interacted with the search engine and other webpages. The eye tracker sampled the position of the participant’s gaze at a rate of 90Hz. From this data stream we identifed fxations, which we defne as a sequence of gaze points where: (1) the sequence accounts for at least 100 milliseconds of time, and (2) all gaze points fall within 15 pixels of a common centroid. A custom Google Chrome browser extension then mapped each centroid, in real-time, to an HTML element on the webpage that the participant was visiting. We logged both information about the fxation (location, duration) and information about the HTML element (e.g., the font size, element type, etc.). Finally, the browser was further instrumented to record page navigation events and search queries. To ensure a degree of ecological validity, all queries were issued to a major commercial web search engine (anonymized)."
    }, {
      "heading" : "3.3 Procedure",
      "text" : "As part of the recruitment process, participants answered a brief screening and demographics questionnaire that collected information about age, gender, occupation, language fuency, education, dyslexia diagnosis, dyslexia-related training/tutoring received, and search engine use (search frequency, preferred sites, and any additional devices or apps used to support searching). As noted above, we excluded participants who were not fuent in English, who were under the age of 13, and who were not located in our general metropolitan area. These exclusion criteria, together with the entire study procedure, were approved by our organization’s IRB.\nWhen each participant arrived at the research lab, the experimenter reviewed the study procedure with the participant, then calibrated the eye tracker to the participant using a 20-point calibration process. The study then proceeded as follows: Participants were asked to complete 6 search tasks, with a maximum of 10 minutes to complete each task, for a total study time of approximately one hour (see Table 1). For each task, the experimenter read a backstory out loud to the participant that outlined a particular information need that the participant needed to address in order to successfully complete that task. This procedure ensured that reading difculties did not impact participants’ understanding of the tasks, and also avoided giving participants clues regarding the spelling of search queries.\nParticipants indicated that they were done with a search task by pressing a button on the keyboard that was marked with a red\nsticker. They then dictated their answer out loud to the experimenter. The experimenter then administered an oral version of the NASA-TLX (task load index), which was modifed to allow participants to respond on a 5-point (rather than 21-point) scale [18, 28]. This was also done orally to reduce reading strain while reporting the task load scores. Participants also reported their prior domain knowledge using a 3-point scale ranging from 1 (łI could have answered this without searching for any information at allž) to 3 (łI did not have any prior knowledge, and had to search for all information.ž). Finally, participants described any challenges they faced during the task, and reported any strategies they used to overcome those challenges. 3.3.1 Search Phases. The 6 search tasks (see Table 1) were divided into 3 phases, with each phase having 2 tasks to check if searcher behavior remained consistent across task diferences. Tasks were presented in a randomized order. Each phase placed additional variables under experimental control so as to more efectively probe diferent stages of web search. These phases are as follows: • Phase 1: Participants were presented with the landing page of the search engine, and the query box was left empty (See Supplementary Materials for example https://tinyurl.com/sigir2020supplementarymaterial). After hearing the description of a search task, participants were free to formulate any query, and could reformulate as often as desired. Likewise, participants were free to open as many search results as necessary. This phase was the most ecologically valid, and allowed us to collect diferences at the query formulation stage of search between SWD and the control group. However, the ensuing diversity of queries, search results, and page-clicks rendered it difcult to compare the populations in later stages of web search. We address this by introducing additional experimental controls in phases 2 and 3, below. • Phase 2: After hearing the description of a search task, participants were presented with a pre-populated search results page for a fxed query that could not be changed. From here, participants were again free to open as many search results as was necessary to complete the current task. Since all participants viewed the same SERP, we can more efectively measure diferences in the results-triage stage of search. However, participants may open diferent pages, or may open no pages at all (i.e., completing the task using search results’ snippets), thus rendering it difcult to compare populations in the fnal information extraction phase of search. • Phase 3: Similar to Phase 2, participants were presented with a pre-populated SERP for a fxed query that could not be changed, but were additionally asked to open at least three webpages from the search results. This overlap of many participants looking at particular webpages allows us to compare information extraction behavior from webpages. 3.3.2 Task Types. All 6 tasks (2 per phase) were informational search tasks (i.e., tasks with an intent to acquire information present in one or more webpages), as opposed to transactional or navigational tasks [16]. To observe if searcher behavior remained consistent across tasks, we ensured each of the 3 phases had 2 tasks. Each phase’s tasks occupied a diferent level of cognitive complexity, as defned in Kelly et al.’s framework [33]. Specifcally, one task occupied the Remember level of complexity, and required participants to retrieve at most one piece of relevant knowledge. The other task occupied the Understand level of complexity, and required constructing meaning from multiple sources or documents. Of the two, Understand tasks are reported to be harder [18, 56]. When developing tasks for this study, we chose a set that covered diverse domains to reduce efects of prior domain knowledge [20]."
    }, {
      "heading" : "3.4 Measures",
      "text" : "To observe and analyze diferences in search and gaze patterns across SWD and control searchers, we measured the following: 3.4.1 Self-Reported Task Load: Each task’s mental, temporal, performance, efort, and stress level self-rated by participants on a 5 point Likert-type post-task questionnaire (a simplifed NASA TLX)\n[18, 28]. Higher TLX scores indicate more challenging tasks, and an overall task load is computed by summing the responses to all fve questions, yielding a score between 5 and 25. 3.4.2 Search Log Measures: From the search logs we measured: (i) Task completion time: total time (in milliseconds) to complete each search task. (ii) Number of queries issued per task. (iii) Length of query: number of terms in a query. (iv) Number of spelling errors in query: including number of phonetic and typographic spelling errors, calculated using DamerauśLevenshtein edit distance [9] which is the minimum number of insertions, deletions, or substitutions of a single character required to change one query term into the correct term. (v) Number of SERPs and webpages visited. (vi) Number of returns to each SERP and webpage\n3.4.3 Eye-tracking Measures: To observe what searchers looked at we divided the SERPs and webpages into several Areas of Interest (AOIs outlined in red in Supplementary Materials https: //tinyurl.com/sigir2020supplementarymaterial). We measured the following across the AOIs from eye tracker data: (i) Attention to an AOI: is measured in terms of fxation duration. This is the total time that someone fxated on the AOI. (ii) Number of search results viewed: items on the search results list on the SERP with at least one fxation. (iii) Fixation Patterns: To observe how participants spatially distribute their visual attention, we looked at a visualization of their fxations on the page to detect any patterns. Previous work [45, 47] has established that searchers examine webpages using the following patterns (see Figure 2):\n• F-shape Pattern: The F-shape Pattern is similar to the shape of its namesake, the letter F. Text on the left and towards the top of the page is read more than text on the right or towards the bottom of the page. [45] • Spotted Pattern: The spotted scanning pattern involves fxating on specifc words or parts of the page. Searchers choose these spots either because of visual salience (like bold or large text), or because word shapes resemble those of specifc words they are looking for to answer the task. [47] • Layer-Cake Pattern: Searchers fxate mostly on the page’s headings and subheadings. There are few other fxations on the text in between Ð that is, until searchers locate the heading or part of the page that they are interested in. At that point, there are many fxations in that particular part. It is the most efective scanning method. [47] • Commitment Pattern: Searchers fxate on all, or most, content words in the body of the page. This pattern demonstrates traditional reading, not scanning, and is the most efective for reading comprehension. [47]\nWe randomly selected 20% of all 167 SERPs and 20% of all 476 webpages visited for two raters to independently label using the above four category defnitions. If a fxation pattern did not ft any of the four categories, then these were labelled as \"NA\". The raters reached an agreement of 0.78 Cohen’s Kappa. The rest were classifed by one of the coders."
    }, {
      "heading" : "4 RESULTS",
      "text" : "In this section we report the fndings of the study, beginning with general metrics of task success, and then discuss fndings specifc\nto each study phase, sequentially focusing on query formulation, search results triage, and information extraction from webpages."
    }, {
      "heading" : "4.1 General Results",
      "text" : "All 27 participants successfully completed each of the 6 search tasks within the time limit of 10 minutes per task. Prior research has shown that people with dyslexia are slower when reading and composing text [35, 38, 39], so we hypothesized that SWD would take longer to complete search tasks than the control group. Though the control group was slightly faster for all tasks, no diferences were signifcant at the = 0.05 level (See Table 1).\nWe also hypothesized that SWD would report exerting more cognitive efort when completing tasks, given the documented challenges that SWD experience when reading, writing, and remembering information [10, 38] together with their tendency to express lower levels of self-esteem and confdence when performing such tasks [6, 31, 43]. We were not able to accept this hypothesis for any task in the frst two phases of the experiment, but found indications that SWD may have experienced a higher task load in the third phase, which required participants to read more webpages (Figure 3). Specifcally, SWD reported higher task load for both tasks, but the diference was signifcant only for the Remember task (p = 0.03, t = 2.27). Given the median task load across all participants and tasks was 7 ś only 2 points higher than the minimum score of 5 ś it is possible that our scale was not sensitive enough at the lower end to detect population diferences. Furthermore, in 2019, Choi, Capra and Arguello found that diferences in working memory did not afect participants’ post-task perceptions about workload during search tasks. Since dyslexia is strongly correlated with lower phonological working memory this result is consistent with their fndings [18]. Also, when asked to report their prior domain knowledge for each task, most participants reported that they \"did not have any prior knowledge and had to search for all information\" (x = 2.62, ˙ = 0.41). Therefore, we do not include it in our analysis of search behavior.\nFinally, we note that in contrast to prior work [33, 56], we did not fnd Remember tasks to be systematically easier, or harder, than Understand tasks ś there were no signifcant diferences in task completion time, nor were there signifcant diferences in reported task load. For the remainder of this paper, we therefore do not diferentiate between task complexity types, and instead treat the pairs of tasks as independent trials within each phase. Next, we present phase-specifc fndings."
    }, {
      "heading" : "4.2 Phase 1 Results: Query Formulation",
      "text" : "In Phase 1 of the study, participants completed a pair of search tasks by composing queries, reviewing SERPs, and optionally retrieving relevant documents. In this phase, we are best-positioned to compare diferences in query formulation; other comparisons are obscured by diferences in the results and webpages seen by searchers.\nWe expected SWD would formulate more queries than the control group, as mentioned in previous studies [11, 19, 37]. Our fndings are consistent with this hypothesis: SWD formulated an average of 2.27 (˙ = 1.37) queries per task, versus 1.54 (˙ = 1.07) queries per task in the control population (p = 0.03, t52 = 2.20).\nLikewise, we expected SWD to make more spelling errors when composing queries, as reported in [11, 37, 38]. With this measure, we are able to strongly confrm our hypothesis: SWD made an average of 0.67 errors per query (˙ = 0.69), versus 0.04 errors per query (˙ = 0.13) within the control group. This diference is highly signifcant (p < 0.01, t52 = 3.26). To further explore what type of errors these were, we manually labelled the errors into: phonetic error (an error at the phoneme level like \"calqulation\" instead of \"calculation\" or \"dipest\" instead of \"deepest\") and typographic error (error because of a typing mistake, identifed if characters typed are close together on the keyboard like \"tennois\" instead of \"tennis\"). Since those with dyslexia have been shown to have trouble spelling because of challenges with phonological decoding [18, 38], we expected SWDs to make more phonetic errors than the control group. Our analysis confrmed that SWDs make more phonetic errors (x=0.35, ˙=0.49) than the control group (x=0.07, ˙=0.26, p=0.01).\nHowever, as reported in Table 3, we did not fnd signifcant differences in average query length, time spent fxating on the query input box, or number of typographic errors. We suspect that autocomplete and other query suggestions may serve as a normalizing factor for query length, but further research is necessary to confrm this hypothesis. Overall, from these results we confrm that SWD struggle with query formulation - issuing more queries and making more errors per query, especially phonetically.\nMeasure SWD Control p t52 # of queries 2.27 1.54 0.03 2.20 (1.37) (1.07) Errors per query 0.67 0.04 < 0.01 3.26 (edit distance) (0.69) (0.13) Phonetic Errors per 0.35 0.07 0.01 2.82 query (edit distance) (0.49) (0.26) Typographic Errors per 0.79 0.07 0.07 1.90 query (edit distance) (1.40) (0.27) Terms per query 6.12\n(2.53) 6.04 (2.92)\n0.91 0.11\nAttention to Search 788 744 0.93 0.01 Box (ms) (1800) (1811)\nTable 3: Mean(˙ ) Query-formulation behavior by searchers with and without dyslexia during Phase 1. Signifcant diferences at the = 0.05 level are highlighted in grey."
    }, {
      "heading" : "4.3 Phase 2 Results: Search Results Triage",
      "text" : "In Phase 2 of the study, participants were presented with a preformulated query-SERP pair per task. They were required to complete tasks by inspecting results on the SERP and optionally opening linked webpages. Since all participants viewed the same SERPs, we can compare SERP triage behavior between groups.\nWe begin by reporting the fxation patterns observed when inspecting the SERPs, and then examine search behavior across specifc AOI types. We found that SWD were most likely to employ the Commitment pattern, and exhibited this strategy for 63.89% of search result pages (vs. 0.05% in the control group). Conversely,\nMeasure Phase 2 SWD Control p t49\n# returns to the same SERP\n4.33 (3.16)\n2.35 (1.37) 0.00 -0.74\n# of webpages opened\n2.77 (1.33)\n2.59 (1.49) 0.44 -0.78\n# results viewed on SERP\n7.67 (4.93)\n3.20 (2.91) 0.04 -0.80\nAttention to Instant Answers (ms) 13,340 (13979) 7,261 (6394) 0.04 -2.07 Attention to Ad results (ms) 5,187 (8161) 837 (1713) 0.01 -2.79 Attention to Organic results (ms) 20,120 (46631) 4,8059 (20724) 0.01 -2.88 Attention to Result titles (ms) 22,339 (19244) 9,507 (8767) 0.00 -3.18 Attention to Result snippets (ms) 24,898 (28977) 7,692 (7360) 0.00 -2.95 Attention to Related Searches (ms) 22,853 (20437) 12,499 (10020) 0.02 -2.38 Attention to Right Rail (ms) 2,506 (3747) 1,607 (2389) 0.32 -1.04 Attention to Images (ms) 4,032 (5094) 4,592 (9270) 0.80 0.26 Attention to Bold (ms) 3,966 (5139) 4,555 (9112) 0.78 0.27\nTable 4: Mean (˙ ) gaze patterns of searchers with and without dyslexia on SERPs in Phase 2. Signifcant diferences at = 0.05 level are highlighted in grey.\npeople in the control group were more likely to employ the F-shape pattern, exhibiting this strategy for 71% of search results (vs. 13.89% in the SWD group). Other scan patterns were rarely employed (Figure 2). The Fisher’s exact test for diferences in proportions fnds these Commitment and F-shape diferences to be highly statistically signifcant (p < 0.01 in both cases). In the context of web search, the Commitment pattern corresponds with a careful and systematic examination of the document, whereas the F-shape pattern indicates quick assessment of relevance (e.g., based on titles), followed by more focused attention on one or more promising snippets [45, 47]. This result helps explain prior fndings reporting SWD struggle with search results triage [37, 43].\nTo further quantify the diferences in search results triage patterns, we count the number of search results visually inspected by participants. We fnd that SWD inspected an average of 7.67 results (˙ = 4.93), which is signifcantly more than the average of 3.20 results (˙ = 2.91) inspected by people in the control group (p = 0.04, t = 0.80). Since without scrolling the SERP shows only 3-4 results as per our experimental setup, this result suggests that SWD scroll further down the SERP than the control group to less relevant results [1]. They might be scrolling further to fnd things that are more readable to them, as suggested by [25, 43]. On the other hand, this might be to fnd more information to add to what they’ve already found, as suggested by P9, an SWD: \"Even if the answer’s given right there at the top, I will continue to look on the page to fnd more information to support it before I fnish searching.\"\nConcern with fnding additional support for an answer may refect a lack of confdence, as suggested by prior literature [6, 31, 43].\nAdditionally, we found that SWD returned to look at the same SERP more times, on average 4.33 (˙ = 2.35) compared with 2.30 returns by the control group (˙ = 2.00, p = 0.00). Since SWD do not open signifcantly more pages than the control group (See Table 3), this suggests that they return to examine the same page more closely or more of it. SWD might re-visit and re-read information because dyslexia is associated with having a shorter working memory [7, 18, 38]. Furthermore, SWD spent more time examining organic search results, instant answers, and advertised results. We also expected SWD to pay more visual attention to bold fonts and images than the control group, because prior work relates these to higher readability scores and SWD prefer more readable documents [25, 35, 41]; however, we could not accept this hypothesis because we did not fnd any signifcant diferences at the = 0.05 level. Nonetheless, feedback from participants in the post-task questionnaire suggests that they rely on these features. For example, P4, an SWD, describes the importance of images: \"I clicked on this (link) because the image showed me it referred to the fencing I was looking for\". P5, also an SWD, says about bold text: \"the answer is right there in bold, so I think it’s right\". Therefore, it is possible that both groups depend equally on these features, or that diferences arise in saccadic patterns rather than fxations.\nEach of these comparisons is detailed in Table 4. Overall, from these results we confrm that SWD struggle with triage of search results: they inspect more results, more carefully, and take longer in this phase than searchers in the control group."
    }, {
      "heading" : "4.4 Phase 3 Results: Information Extraction",
      "text" : "In Phase 3 of the study, participants were presented with a preformulated query-SERP pair per task. They were required to complete tasks by inspecting results on the given SERP and opening at least 3 linked webpages. From the 3 webpages selected by each participant, there were only 2 webpages (1 in each task) that all 27 participants all viewed. Therefore, we chose to focus our analysis on those 2 webpages. Phase 3’s main focus was to studying behaviors on retrieved webpages. While there was an overlap in the SERPs viewed by participants in this phase too, we cannot analyze and report on the SERP triage behavior for this phase because triage behavior could have been afected by our requirement to open at least 3 webpages when one or none might have sufced.\nTo analyze information extraction behavior on webpages, we identifed one page for each task that all participants visited. For the webpage seen by all in the Phase 3 Remember Task 1, SWD usually exhibit a Commitment pattern, with 87.5% of SWD exhibiting this strategy (vs 12.5% of the control group). Conversely, participants in the control group were more likely to employ the F-shape pattern, with 77.78% of the control group exhibiting this strategy (vs 23% of SWD). Other scan patterns were rarely employed. The Fisher’s exact test for diferences in proportions fnds these Commitment and F-shape diferences to be highly signifcant (p < 0.01). On the webpage in the Phase 3 Understand Task 2, SWD were, again, most likely to employ the Commitment pattern, with 74.89% of them\n1http://www.tax-rates.org/north_carolina/orange_county_property_tax 2https://theexoticbean.com/blog/fair-trade-cofee/what-the-fair-trade-cofee-labelreally-means/\nexhibiting this strategy (vs 20% of the control group). Conversely, participants in the control group were more likely to employ the Fshape pattern, with 75% of the control group exhibiting this strategy (vs 25% of SWD). Again, other scan patterns were rarely employed. The Fisher’s exact test for diferences in proportions fnds these to be highly signifcant (p < 0.01).\nThese results reiterate the fxation patterns seen in Phase 2 for inspecting SERPs. Since the Commitment pattern signifes reading each part of the page carefully rather than skimming, this result indicates that SWD may be employing less efcient page-scanning strategies during information extraction. Furthermore, these results confrm that SWD exhibit diferent gaze patterns than the control group, and this may indicate that SWD struggle with information extraction, as intimated by the NASA TLX responses reported earlier.\nResults from the post-task questionnaire enrich our understanding of the challenges that SWD face when extracting information from webpages, as well as some of the strategies that SWD employed at this stage of the search process. Specifcally, participants referred to the usefulness of images, menus, tables, and lists; they also reported a desire to encounter fewer ads, less italicized text, and more bold and large text. Referring to menus, P4, an SWD, said, \"I always go to the table of contents on Wikipedia to direct me\", and P23, an SWD, said, \"I couldn’t fnd what I was looking for so I went to the drop down menu and selected ’sort by’ to flter\". P17, also an SWD, said about lists, \"I just want to see a list of the answers in front of me\". About textual features, P18 from the control group said, \"the bold print led me to where I want to go.\" They also said, \"well, it’s got a box around it and it’s bold so I think that helped.\" P12, an SWD, said, \"I found what I was looking for because it was big and bold\". These qualitative results are consistent with prior self-report results [25, 39, 43]. Conversely, though each of these properties was mentioned by participants, we did not fnd any signifcant quantitative diferences in how SWD and the control group fxated on these features (Table 5). It is possible that both groups depend equally on these features, or that diferences arise in saccadic patterns rather than fxations."
    }, {
      "heading" : "5 DISCUSSION",
      "text" : "This paper is the frst to present fndings from gaze data collected from English-speaking searchers with and without dyslexia using a modern interactive search engine during the complete query-triageextraction process of search. The gaze patterns and search behavior demonstrate that searchers with dyslexia have more spelling errors (particularly phonetic errors) during query formulation, look further down the SERP, and use less-efcient page-scanning patterns than searchers in the control group. In this section we outline several design implications of our fndings, discuss the study’s limitations, and suggest opportunities for future work."
    }, {
      "heading" : "5.1 Design Implications",
      "text" : "5.1.1 Qery Formulation: During query formulation, SWD issued more queries and made more errors per query (particularly more phonetic errors as opposed to typographic errors) than the control group. To help with phonetic spelling errors, autocomplete could optionally be confgured to more aggressively correct spelling errors and/or to incorporate dyslexia-specifc updates to spellcheck\nalgorithms, such as proposed by Rello et al. in the context of word processing [48]. Furthermore, to generally help with formulating their information need, autocomplete could suggest not only popularly searched queries, but also make sure that suggestions are semantically diverse to cover more possibilities. Also, since SWD issued more queries than the control group to fnd more relevant, readable, and trustworthy results, the browser could show searchers rich, multi-modal, instant answers as they type in the query. This could help searchers fnd relevant information quicker, make the result more glanceable, and help them evaluate and refne the query as they’re typing. Furthermore, since instant answers are usually sourced from Wikipedia, a source deemed trustworthy by SWD [34], these answers will reduce the challenge to triage trustworthiness by SWD and non-SWD alike [40].\n5.1.2 Search Results Triage: When triaging search results, SWD came back to look at the same SERP more times and inspected more results. They examined the SERP exhaustively using the Commitment fxation pattern, and scrolled far below the control group to less relevant results to possibly fnd more readable and trustworthy results. Search engines and their interfaces must make it easier to fnd more readable results and assess trustworthiness quickly. These fndings bolster the need to redesign the search algorithm to re-rank results using readability and trustworthiness more heavily than it currently does [21, 51] and add to previous work [25, 35] that informs what factors (e.g., amount of images, headings, ads) lead to more readable SERPs and webpages. To make it easier to triage\ntrustworthiness and readability of a result, we could crowdsource trustworthiness and readability ratings for each result and present it to searchers as a visualization (like in [50]) or an icon (like in [12]). Additionally, since we now know that SWD examine more of the SERP, in a more committed manner (focusing on organic and advertised search results, instant answers, etc.) we can spatially organize SERP elements accordingly to prioritize more readable, relevant, and trustworthy content. For example, regulatory bodies who wish to ensure equal access to content by people with dyslexia may need to pass regulations limiting layout options for ads, pushing more readable, relevant, and credible content to the top-left.\n5.1.3 Information Extraction: When extracting information from webpages, SWD took longer and reported it to be harder than the control group. We also found that SWD examine webpages in a more committed manner than the control group. This could inform how we design webpages and spatially organize relevant and important information. For example, by providing summaries of each webpage at the top that can be used to help navigate the website and to expand only more relevant parts so that SWD don’t have to committedly read the entire page. Furthermore, the browser interface and plugins could increase readability by automatically enlarging text as proposed by Bigham in [15], and to mitigate memory challenges faced by SWD preserve highlighted and zoomed sections. The browser could enable this information to be extracted easily by either taking a screenshot or allowing easy export of these sections into a notepad.\nWhile we propose several design implications for search engines, browsers, SERPs, and webpages based on our fndings, implementing these design ideas and verifying their efectiveness for searchers with dyslexia is left to future work. While our investigation focused on web search, many of these design suggestions may also enhance the usability and inclusivity of other information systems (e.g., ebooks). We also need to do more research to test if these fndings can help inform better search tools for those with other causes for reading diferences such as English language learners and children who are learning to read."
    }, {
      "heading" : "5.2 Limitations and Future Work",
      "text" : "This study has limitations as it tries to balance between ecological validity and the need to impose experimental control. Here, we discuss their potential impact, how we tried to address the limitations, and propose future work. First, we did not allow searchers to use any assistive technology, or change any of the default display settings of the browser. This controlled the visual interface all participants experienced, and allowed us to more easily compare behaviors across diferent participants. However, this altered the user experience for at least two people; one participant reported using a more aggressive spelling auto-correct technology on their personal computer and another reported difculty because the study prevented them from zooming in.\nInstructing participants to open at least 3 webpages from the SERP in phase 3 was another limitation of the study design. This potentially impacted how they triaged the search results and extracted information. We tried to reduce these efects by allowing them to choose which 3 links they wanted to open. This freedom\nin choosing the links resulted in having only two webpages common between all participants. If there had been more overlap in the visited webpages in phase 3, we may have had more statistical power in analysing diferences in visual attention paid to elements on webpages.\nWe recruited only searchers fuent in English, above the age of 13, and within a major metropolitan area using ads targeted towards dyslexia and dyslexia-related organizations. Recruiting via social media biased us to a population with a certain level of technical literacy. Furthermore, self-selection bias may also impact our fndings - maybe the people who responded to our ads had more severe dyslexia-related challenges, or had friends or family who had dyslexia and therefore followed dyslexia-related organizations. In future studies we could employ diferent recruitment and sampling methods to reduce these biases.\nWhile we ensured that all SWD had a medical diagnosis of dyslexia, we recognize that dyslexia is a spectrum disorder, and there could be individual diferences that do not generalize to other searchers with dyslexia. In future studies, when quick diagnostic tests of dyslexia (for example, [49]) become widely or clinically accepted or available in English language [8], we can control for individual diferences and better model related behaviors and strategies to diferent points along the spectrum. Future research is required to overcome these limitations, build out and test suggested design implications of these fndings."
    }, {
      "heading" : "6 CONCLUSION",
      "text" : "By conducting an eye-tracking study observing 27 participants (14 with dyslexia, 13 control) use a widely-used modern Englishlanguage interactive search engine, we confrmed that searchers with dyslexia struggle with all stages of the search process: query formulation, search results triage, and information extraction. Furthermore, we established that searchers with and without dyslexia have noticeably diferent ways of visually attending to SERPs and webpages, including to individual page elements and to the page overall. Moreover, we learned that many of the challenges and strategies reported by participants in self-report studies manifest in the eye tracking data. We conclude by refecting on our fndings to propose design implications for improving utility and cognitive accessibility of search systems for people with dyslexia."
    } ],
    "references" : [ {
      "title" : "Special education teachers. https://datausa.io/profle/soc/252050/ #demographics",
      "author" : [ "n. d" ],
      "venue" : null,
      "citeRegEx" : "2",
      "shortCiteRegEx" : "2",
      "year" : 2050
    }, {
      "title" : "Find it if you can: a game for modeling diferent types of web search success using interaction data",
      "author" : [ "Mikhail Ageev", "Qi Guo", "Dmitry Lagun", "Eugene Agichtein" ],
      "venue" : "In Proceedings of SIGIR 2011. ACM",
      "citeRegEx" : "3",
      "shortCiteRegEx" : "3",
      "year" : 2011
    }, {
      "title" : "Web navigation for individuals with dyslexia: an exploratory study",
      "author" : [ "Areej Al-Wabil", "Panayiotis Zaphiris", "Stephanie Wilson" ],
      "venue" : "In International Conference on Universal Access in Human-Computer Interaction. Springer,",
      "citeRegEx" : "4",
      "shortCiteRegEx" : "4",
      "year" : 2007
    }, {
      "title" : "Examining visual attention of dyslexics on web navigation structures with eye tracking",
      "author" : [ "Areej Al-Wabil", "Panayiotis Zaphiris", "Stephanie Wilson" ],
      "venue" : "In 2008 International Conference on Innovations in Information Technology",
      "citeRegEx" : "5",
      "shortCiteRegEx" : "5",
      "year" : 2008
    }, {
      "title" : "How dyslexic teenagers cope: an investigation of self-esteem, coping and depression",
      "author" : [ "Neil Alexander-Passe" ],
      "venue" : "Dyslexia 12,",
      "citeRegEx" : "6",
      "shortCiteRegEx" : "6",
      "year" : 2006
    }, {
      "title" : "Spelling-error tolerant, order-independent pass-phrases via the Damerau-Levenshtein string-edit distance metric. In Proceedings of the Session 4C: Neural Networks and Embedding SIGIR ’20",
      "author" : [ "Gregory V Bard" ],
      "venue" : "July 25–30,",
      "citeRegEx" : "9",
      "shortCiteRegEx" : "9",
      "year" : 2007
    }, {
      "title" : "Dyslexic children show short-term memory defcits in phonological storage and serial rehearsal: an fMRI study",
      "author" : [ "Harald Beneventi", "Finn Egil Tønnessen", "Lars Ersland" ],
      "venue" : "International Journal of Neuroscience 119,",
      "citeRegEx" : "10",
      "shortCiteRegEx" : "10",
      "year" : 2009
    }, {
      "title" : "Search and fnd? An accessibility study of dyslexia and information retrieval",
      "author" : [ "Gerd Berget" ],
      "venue" : null,
      "citeRegEx" : "11",
      "shortCiteRegEx" : "11",
      "year" : 2016
    }, {
      "title" : "The efect of dyslexia on searching visual and textual content: are icons really useful",
      "author" : [ "Gerd Berget", "Frode Eika Sandnes" ],
      "venue" : "In International Conference on Universal Access in Human-Computer Interaction. Springer,",
      "citeRegEx" : "12",
      "shortCiteRegEx" : "12",
      "year" : 2015
    }, {
      "title" : "Searching databases without querybuilding aids: implications for dyslexic users",
      "author" : [ "Gerd Berget", "Frode Eika Sandnes" ],
      "venue" : "Information Research: An International Electronic Journal 20,",
      "citeRegEx" : "13",
      "shortCiteRegEx" : "13",
      "year" : 2015
    }, {
      "title" : "Do autocomplete functions reduce the impact of dyslexia on information-searching behavior? The case of G oogle",
      "author" : [ "Gerd Berget", "Frode Eika Sandnes" ],
      "venue" : "Journal of the Association for Information Science and Technology 67,",
      "citeRegEx" : "14",
      "shortCiteRegEx" : "14",
      "year" : 2016
    }, {
      "title" : "Making the web easier to see with opportunistic accessibility improvement",
      "author" : [ "Jefrey P Bigham" ],
      "venue" : "In Proceedings of the 27th annual ACM symposium on User interface software and technology. ACM,",
      "citeRegEx" : "15",
      "shortCiteRegEx" : "15",
      "year" : 2014
    }, {
      "title" : "A taxonomy of web search",
      "author" : [ "Andrei Broder" ],
      "venue" : "SIGIR FORUM 36,",
      "citeRegEx" : "16",
      "shortCiteRegEx" : "16",
      "year" : 2002
    }, {
      "title" : "What do you see when you’re surfng?: using eye tracking to predict salient regions of web pages",
      "author" : [ "Georg Buscher", "Edward Cutrell", "Meredith Ringel Morris" ],
      "venue" : "In Proceedings of the SIGCHI conference on human factors in computing systems. ACM,",
      "citeRegEx" : "17",
      "shortCiteRegEx" : "17",
      "year" : 2009
    }, {
      "title" : "The Efects of Working Memory during Search Tasks of Varying Complexity",
      "author" : [ "Bogeum Choi", "Robert Capra", "Jaime Arguello" ],
      "venue" : "In Proceedings of the 2019 Conference on Human Information Interaction and Retrieval. ACM,",
      "citeRegEx" : "18",
      "shortCiteRegEx" : "18",
      "year" : 2019
    }, {
      "title" : "Does dyslexia present barriers to information literacy in an online environment? A pilot study",
      "author" : [ "Lynne Cole", "Andrew MacFarlane", "George Buchanan" ],
      "venue" : "Library and Information Research 40,",
      "citeRegEx" : "19",
      "shortCiteRegEx" : "19",
      "year" : 2016
    }, {
      "title" : "Knowledge efects on document selection in search results pages",
      "author" : [ "Michael J Cole", "Xiangmin Zhang", "Chang Liu", "Nicholas J Belkin", "Jacek Gwizdka" ],
      "venue" : "In Proceedings of the 34th international ACM SIGIR conference on Research and development in Information Retrieval. ACM,",
      "citeRegEx" : "20",
      "shortCiteRegEx" : "20",
      "year" : 2011
    }, {
      "title" : "Personalizing web search results by reading level",
      "author" : [ "Kevyn Collins-Thompson", "Paul N Bennett", "Ryen W White", "Sebastian De La Chica", "David Sontag" ],
      "venue" : "In Proceedings of the 20th ACM international conference on Information and knowledge management. ACM,",
      "citeRegEx" : "21",
      "shortCiteRegEx" : "21",
      "year" : 2011
    }, {
      "title" : "What are you looking for?: an eyetracking study of information usage in web search",
      "author" : [ "Edward Cutrell", "Zhiwei Guan" ],
      "venue" : "In Proceedings of the SIGCHI conference on Human factors in computing systems. ACM,",
      "citeRegEx" : "22",
      "shortCiteRegEx" : "22",
      "year" : 2007
    }, {
      "title" : "Visual hierarchy and viewing behavior: An eye tracking study",
      "author" : [ "Soussan Djamasbi", "Marisa Siegel", "Tom Tullis" ],
      "venue" : "In International Conference on Human- Computer Interaction. Springer,",
      "citeRegEx" : "23",
      "shortCiteRegEx" : "23",
      "year" : 2011
    }, {
      "title" : "Individual diferences in gaze patterns for web search",
      "author" : [ "Susan T Dumais", "Georg Buscher", "Edward Cutrell" ],
      "venue" : "In Proceedings of the third symposium on Information interaction in context. ACM,",
      "citeRegEx" : "24",
      "shortCiteRegEx" : "24",
      "year" : 2010
    }, {
      "title" : "Assessing the readability of web search results for searchers with dyslexia",
      "author" : [ "Adam Fourney", "Meredith Ringel Morris", "Abdullah Ali", "Laura Vonessen" ],
      "venue" : "In The 41st International ACM SIGIR Conference on Research & Development in Information Retrieval. ACM,",
      "citeRegEx" : "25",
      "shortCiteRegEx" : "25",
      "year" : 2018
    }, {
      "title" : "Comorbidity of ADHD and dyslexia",
      "author" : [ "Eva Germanò", "Antonella Gagliano", "Paolo Curatolo" ],
      "venue" : "Developmental neuropsychology 35,",
      "citeRegEx" : "26",
      "shortCiteRegEx" : "26",
      "year" : 2010
    }, {
      "title" : "n. d.]. Social Media Update 2016",
      "author" : [ "S Greenwood", "A Perrin", "M Duggan" ],
      "venue" : "Pew Research Center for Internet and Technology. November",
      "citeRegEx" : "27",
      "shortCiteRegEx" : "27",
      "year" : 2016
    }, {
      "title" : "NASA-task load index (NASA-TLX); 20 years later",
      "author" : [ "Sandra G Hart" ],
      "venue" : "In Proceedings of the human factors and ergonomics society annual meeting,",
      "citeRegEx" : "28",
      "shortCiteRegEx" : "28",
      "year" : 2006
    }, {
      "title" : "Gender ratios for reading difculties",
      "author" : [ "Jesse L Hawke", "Richard K Olson", "Erik G Willcut", "Sally J Wadsworth", "John C DeFries" ],
      "venue" : "Dyslexia 15,",
      "citeRegEx" : "29",
      "shortCiteRegEx" : "29",
      "year" : 2009
    }, {
      "title" : "The Myths and Truths of Dyslexia in Diferent Writing Systems. International Dyslexia Association blog",
      "author" : [ "F. Hoeft", "P. McCardle", "K. Pugh" ],
      "venue" : null,
      "citeRegEx" : "30",
      "shortCiteRegEx" : "30",
      "year" : 2015
    }, {
      "title" : "Self-concept and self-esteem in developmental dyslexia",
      "author" : [ "Neil Humphrey", "Patricia M Mullins" ],
      "venue" : "Journal of Research in Special Educational Needs 2,",
      "citeRegEx" : "31",
      "shortCiteRegEx" : "31",
      "year" : 2002
    }, {
      "title" : "Computers and Iphones and Mobile Phones, Oh My!: A Logs-based Comparison of Search Users on Diferent Devices",
      "author" : [ "Maryam Kamvar", "Melanie Kellar", "Rajan Patel", "Ya Xu" ],
      "venue" : "In Proceedings of the 18th International Conference on World Wide Web (WWW ’09)",
      "citeRegEx" : "32",
      "shortCiteRegEx" : "32",
      "year" : 2009
    }, {
      "title" : "Development and evaluation of search tasks for IIR experiments using a cognitive complexity framework",
      "author" : [ "Diane Kelly", "Jaime Arguello", "Ashlee Edwards", "Wan-ching Wu" ],
      "venue" : "In Proceedings of the 2015 International Conference on The Theory of Information Retrieval. ACM,",
      "citeRegEx" : "33",
      "shortCiteRegEx" : "33",
      "year" : 2015
    }, {
      "title" : "When trustworthy information becomes inaccessible: The search behaviour of users with dyslexia in an online encyclopedia",
      "author" : [ "Birgit Kvikne", "Gerd Berget" ],
      "venue" : null,
      "citeRegEx" : "34",
      "shortCiteRegEx" : "34",
      "year" : 2018
    }, {
      "title" : "The Impact of Web Browser Reader Views on Reading Speed and User Experience",
      "author" : [ "Qisheng Li", "Meredith Ringel Morris", "Adam Fourney", "Kevin Larson", "Katharina Reinecke" ],
      "venue" : "In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems",
      "citeRegEx" : "35",
      "shortCiteRegEx" : "35",
      "year" : 2019
    }, {
      "title" : "Eye tracking and online search: Lessons learned and challenges ahead",
      "author" : [ "Lori Lorigo", "Maya Haridasan", "Hrönn Brynjarsdóttir", "Ling Xia", "Thorsten Joachims", "Geri Gay", "Laura Granka", "Fabio Pellacini", "Bing Pan" ],
      "venue" : "Journal of the American Society for Information Science and Technology 59,",
      "citeRegEx" : "36",
      "shortCiteRegEx" : "36",
      "year" : 2008
    }, {
      "title" : "The efect of dyslexia on information retrieval: A pilot study",
      "author" : [ "Andrew MacFarlane", "Areej Al-Wabil", "Chloe Ruth Marshall", "A Albrair", "Susan A Jones", "Panayiotis Zaphiris" ],
      "venue" : "Journal of Documentation",
      "citeRegEx" : "37",
      "shortCiteRegEx" : "37",
      "year" : 2010
    }, {
      "title" : "Phonological working memory impacts on information searching: an investigation of dyslexia",
      "author" : [ "Andrew MacFarlane", "A Albrair", "CR Marshall", "George Buchanan" ],
      "venue" : "In Proceedings of the 4th Information Interaction in Context Symposium. ACM,",
      "citeRegEx" : "38",
      "shortCiteRegEx" : "38",
      "year" : 2012
    }, {
      "title" : "Visual analysis of dyslexia on search",
      "author" : [ "Andrew MacFarlane", "George Buchanan", "Areej Al-Wabil", "Gennady Andrienko", "Natalia Andrienko" ],
      "venue" : "In Proceedings of the 2017 Conference on Conference Human Information Interaction and Retrieval. ACM,",
      "citeRegEx" : "39",
      "shortCiteRegEx" : "39",
      "year" : 2017
    }, {
      "title" : "Google Instant Search: The Complete User’s Guide",
      "author" : [ "Matt McGee" ],
      "venue" : null,
      "citeRegEx" : "40",
      "shortCiteRegEx" : "40",
      "year" : 2010
    }, {
      "title" : "Guideline-Based Evaluation of Web Readability",
      "author" : [ "Aliaksei Miniukovich", "Michele Scaltritti", "Simone Sulpizio", "Antonella De Angeli" ],
      "venue" : "In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems",
      "citeRegEx" : "41",
      "shortCiteRegEx" : "41",
      "year" : 2019
    }, {
      "title" : "Collaborative Search Revisited",
      "author" : [ "Meredith Ringel Morris" ],
      "venue" : "In Proceedings of the 2013 Conference on Computer Supported Cooperative Work (CSCW ’13)",
      "citeRegEx" : "42",
      "shortCiteRegEx" : "42",
      "year" : 2013
    }, {
      "title" : "Understanding the needs of searchers with dyslexia",
      "author" : [ "Meredith Ringel Morris", "Adam Fourney", "Abdullah Ali", "Laura Vonessen" ],
      "venue" : "In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems",
      "citeRegEx" : "43",
      "shortCiteRegEx" : "43",
      "year" : 2018
    }, {
      "title" : "SearchTogether: An Interface for Collaborative Web Search",
      "author" : [ "Meredith Ringel Morris", "Eric Horvitz" ],
      "venue" : "In Proceedings of the 20th Annual ACM Symposium on User Interface Software and Technology (UIST ’07)",
      "citeRegEx" : "44",
      "shortCiteRegEx" : "44",
      "year" : 2007
    }, {
      "title" : "F-Shaped Pattern For Reading Web Content (original eyetracking research)",
      "author" : [ "Jakob Nielsen" ],
      "venue" : null,
      "citeRegEx" : "45",
      "shortCiteRegEx" : "45",
      "year" : 2006
    }, {
      "title" : "Exhaustive Review or \"I Can’t Believe It’s Not There\" Phenomenon",
      "author" : [ "Kara Pernice" ],
      "venue" : null,
      "citeRegEx" : "46",
      "shortCiteRegEx" : "46",
      "year" : 2017
    }, {
      "title" : "Text Scanning Patterns: Eyetracking Evidence",
      "author" : [ "Kara Pernice" ],
      "venue" : null,
      "citeRegEx" : "47",
      "shortCiteRegEx" : "47",
      "year" : 2019
    }, {
      "title" : "Frequent words improve readability and short words improve understandability for people with dyslexia",
      "author" : [ "Luz Rello", "Ricardo Baeza-Yates", "Laura Dempere-Marco", "Horacio Saggion" ],
      "venue" : "In IFIP Conference on Human-Computer Interaction. Springer,",
      "citeRegEx" : "48",
      "shortCiteRegEx" : "48",
      "year" : 2013
    }, {
      "title" : "Dytective: Diagnosing risk of dyslexia with a game",
      "author" : [ "Luz Rello", "Miguel Ballesteros", "Abdullah Ali", "Miquel Serra", "Daniela Alarcón Sánchez", "Jefrey P Bigham" ],
      "venue" : "In Proceedings of the 10th EAI International Conference on Pervasive Computing Technologies for Healthcare. ICST (Institute for Computer Sciences,",
      "citeRegEx" : "49",
      "shortCiteRegEx" : "49",
      "year" : 2016
    }, {
      "title" : "Augmenting web pages and search results to support credibility assessment",
      "author" : [ "Julia Schwarz", "Meredith Ringel Morris" ],
      "venue" : "In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. ACM,",
      "citeRegEx" : "50",
      "shortCiteRegEx" : "50",
      "year" : 2011
    }, {
      "title" : "Fighting search engine amnesia: Reranking repeated results",
      "author" : [ "Milad Shokouhi", "Ryen W White", "Paul Bennett", "Filip Radlinski" ],
      "venue" : "In Proceedings of the 36th international ACM SIGIR conference on Research and development in information retrieval. ACM,",
      "citeRegEx" : "51",
      "shortCiteRegEx" : "51",
      "year" : 2013
    }, {
      "title" : "Eye movement patterns on single and dual-column web pages",
      "author" : [ "Sav Shrestha", "Justin W Owens" ],
      "venue" : "Usability News 10,",
      "citeRegEx" : "52",
      "shortCiteRegEx" : "52",
      "year" : 2008
    }, {
      "title" : "Information Re-retrieval: Repeat Queries in Yahoo’s Logs",
      "author" : [ "Jaime Teevan", "Eytan Adar", "Rosie Jones", "Michael A.S. Potts" ],
      "venue" : "In Proceedings of the 30th Annual International ACM SIGIR Conference on Research and Development in Information Retrieval (SIGIR ’07)",
      "citeRegEx" : "53",
      "shortCiteRegEx" : "53",
      "year" : 2007
    }, {
      "title" : "Investigating the Querying and Browsing Behavior of Advanced Search Engine Users",
      "author" : [ "Ryen W. White", "Dan Morris" ],
      "venue" : "In Proceedings of the 30th Annual International ACM SIGIR Conference on Research and Development in Information Retrieval (SIGIR ’07)",
      "citeRegEx" : "54",
      "shortCiteRegEx" : "54",
      "year" : 2007
    }, {
      "title" : "Exploratory Search: Beyond the Query- Response Paradigm",
      "author" : [ "Ryen W. White", "Resa A. Roth" ],
      "venue" : null,
      "citeRegEx" : "55",
      "shortCiteRegEx" : "55",
      "year" : 2009
    }, {
      "title" : "Grannies, tanning beds, tattoos and NASCAR: Evaluation of search tasks with varying levels of cognitive complexity",
      "author" : [ "Wan-Ching Wu", "Diane Kelly", "Ashlee Edwards", "Jaime Arguello" ],
      "venue" : "In Proceedings of the 4th Information Interaction in Context Symposium. ACM, 254ś257. Session 4C: Neural Networks and Embedding SIGIR",
      "citeRegEx" : "56",
      "shortCiteRegEx" : "56",
      "year" : 2012
    } ],
    "referenceMentions" : [ {
      "referenceID" : 26,
      "context" : "Dyslexia is a cognitive diference that impacts about 15% of English speakers [7] (incidence rates vary by language [30]).",
      "startOffset" : 115,
      "endOffset" : 119
    }, {
      "referenceID" : 31,
      "context" : "These challenges often manifest in a slower reading rate and lower reading comprehension [35].",
      "startOffset" : 89,
      "endOffset" : 93
    }, {
      "referenceID" : 2,
      "context" : "engine use - including query formulation, search result triage and information extraction from target webpages - is particularly challenging for this population [4, 19, 35, 37, 43].",
      "startOffset" : 161,
      "endOffset" : 180
    }, {
      "referenceID" : 15,
      "context" : "engine use - including query formulation, search result triage and information extraction from target webpages - is particularly challenging for this population [4, 19, 35, 37, 43].",
      "startOffset" : 161,
      "endOffset" : 180
    }, {
      "referenceID" : 31,
      "context" : "engine use - including query formulation, search result triage and information extraction from target webpages - is particularly challenging for this population [4, 19, 35, 37, 43].",
      "startOffset" : 161,
      "endOffset" : 180
    }, {
      "referenceID" : 33,
      "context" : "engine use - including query formulation, search result triage and information extraction from target webpages - is particularly challenging for this population [4, 19, 35, 37, 43].",
      "startOffset" : 161,
      "endOffset" : 180
    }, {
      "referenceID" : 39,
      "context" : "engine use - including query formulation, search result triage and information extraction from target webpages - is particularly challenging for this population [4, 19, 35, 37, 43].",
      "startOffset" : 161,
      "endOffset" : 180
    }, {
      "referenceID" : 21,
      "context" : "Online experiments comparing search behaviors of people with and without dyslexia have identifed some features of webpages, such as average line length and the ratio of images to text, that impact page readability for people with dyslexia [25].",
      "startOffset" : 239,
      "endOffset" : 243
    }, {
      "referenceID" : 12,
      "context" : "Researchers in information retrieval and HCI have extensively studied user interaction with web search systems, particularly for complex informational [16] or exploratory [55] search tasks.",
      "startOffset" : 151,
      "endOffset" : 155
    }, {
      "referenceID" : 51,
      "context" : "Researchers in information retrieval and HCI have extensively studied user interaction with web search systems, particularly for complex informational [16] or exploratory [55] search tasks.",
      "startOffset" : 171,
      "endOffset" : 175
    }, {
      "referenceID" : 1,
      "context" : "Such tasks typically comprise three stages [3, 43]: query formulation (i.",
      "startOffset" : 43,
      "endOffset" : 50
    }, {
      "referenceID" : 39,
      "context" : "Such tasks typically comprise three stages [3, 43]: query formulation (i.",
      "startOffset" : 43,
      "endOffset" : 50
    }, {
      "referenceID" : 28,
      "context" : ", [32, 53, 54]), gathering self-report data from surveys, interviews, or diary studies of end-users (e.",
      "startOffset" : 2,
      "endOffset" : 14
    }, {
      "referenceID" : 49,
      "context" : ", [32, 53, 54]), gathering self-report data from surveys, interviews, or diary studies of end-users (e.",
      "startOffset" : 2,
      "endOffset" : 14
    }, {
      "referenceID" : 50,
      "context" : ", [32, 53, 54]), gathering self-report data from surveys, interviews, or diary studies of end-users (e.",
      "startOffset" : 2,
      "endOffset" : 14
    }, {
      "referenceID" : 38,
      "context" : ", [42, 43]), and recruiting participants to perform controlled search tasks (e.",
      "startOffset" : 2,
      "endOffset" : 10
    }, {
      "referenceID" : 39,
      "context" : ", [42, 43]), and recruiting participants to perform controlled search tasks (e.",
      "startOffset" : 2,
      "endOffset" : 10
    }, {
      "referenceID" : 18,
      "context" : "have begun to use eye tracking to understand which aspects of the SERP users attend to [22, 23, 36, 52].",
      "startOffset" : 87,
      "endOffset" : 103
    }, {
      "referenceID" : 19,
      "context" : "have begun to use eye tracking to understand which aspects of the SERP users attend to [22, 23, 36, 52].",
      "startOffset" : 87,
      "endOffset" : 103
    }, {
      "referenceID" : 32,
      "context" : "have begun to use eye tracking to understand which aspects of the SERP users attend to [22, 23, 36, 52].",
      "startOffset" : 87,
      "endOffset" : 103
    }, {
      "referenceID" : 48,
      "context" : "have begun to use eye tracking to understand which aspects of the SERP users attend to [22, 23, 36, 52].",
      "startOffset" : 87,
      "endOffset" : 103
    }, {
      "referenceID" : 41,
      "context" : "For example, eye tracking studies have revealed that searchers usually fxate on SERPs and webpages in an F-shape pattern [45, 46].",
      "startOffset" : 121,
      "endOffset" : 129
    }, {
      "referenceID" : 42,
      "context" : "For example, eye tracking studies have revealed that searchers usually fxate on SERPs and webpages in an F-shape pattern [45, 46].",
      "startOffset" : 121,
      "endOffset" : 129
    }, {
      "referenceID" : 20,
      "context" : "These studies have also shown that searchers distribute their visual attention diferently across organic and ad results on a SERP [24], and that one can determine a webpage’s most salient parts by looking at the amount of visual attention paid to its diferent elements [17].",
      "startOffset" : 130,
      "endOffset" : 134
    }, {
      "referenceID" : 13,
      "context" : "These studies have also shown that searchers distribute their visual attention diferently across organic and ad results on a SERP [24], and that one can determine a webpage’s most salient parts by looking at the amount of visual attention paid to its diferent elements [17].",
      "startOffset" : 269,
      "endOffset" : 273
    }, {
      "referenceID" : 39,
      "context" : "[43] reported SWD have trouble spelling words at the phonetic level.",
      "startOffset" : 0,
      "endOffset" : 4
    }, {
      "referenceID" : 9,
      "context" : "Berget and Sandness [13] compared search logs of 21 students with and 21 without dyslexia who had formulated Norwegian queries for a Norwegian academic library system with no query-formulation aids.",
      "startOffset" : 20,
      "endOffset" : 24
    }, {
      "referenceID" : 15,
      "context" : "[19] confrmed these fndings for English queries in a system without any query formulation aids.",
      "startOffset" : 0,
      "endOffset" : 4
    }, {
      "referenceID" : 10,
      "context" : "Sandness [14] found that when SWD used Google, a modern interactive search engine with query formulation aids, for formulating Norwegian queries, there were no diferences in query formulation behavior.",
      "startOffset" : 9,
      "endOffset" : 13
    }, {
      "referenceID" : 33,
      "context" : "[37] conducted a search log analysis of people with dyslexia interacting with an information retrieval interface (Okapi), and found SWD",
      "startOffset" : 0,
      "endOffset" : 4
    }, {
      "referenceID" : 6,
      "context" : ", the ability to hold words in short-term memory) [10, 38].",
      "startOffset" : 50,
      "endOffset" : 58
    }, {
      "referenceID" : 34,
      "context" : ", the ability to hold words in short-term memory) [10, 38].",
      "startOffset" : 50,
      "endOffset" : 58
    }, {
      "referenceID" : 14,
      "context" : "In 2019, a search log study of participants with low and high working memory found that those with lower working memory take more time to frst click on the SERP, open fewer links, and take more time between events [18].",
      "startOffset" : 214,
      "endOffset" : 218
    }, {
      "referenceID" : 2,
      "context" : "’s [4] interview study observing searchers with dyslexia navigate multiple",
      "startOffset" : 3,
      "endOffset" : 6
    }, {
      "referenceID" : 3,
      "context" : "[5], observed 7 participants (2 with dyslexia and 5 controls) navigate webpages within 6 websites to extract information.",
      "startOffset" : 0,
      "endOffset" : 3
    }, {
      "referenceID" : 35,
      "context" : "A follow-up analysis reported SWD changed scan direction more on the webpage than the control group [39].",
      "startOffset" : 100,
      "endOffset" : 104
    }, {
      "referenceID" : 21,
      "context" : "[25] found SWD’s relevance ratings of webpages were highly correlated with their readability scores.",
      "startOffset" : 0,
      "endOffset" : 4
    }, {
      "referenceID" : 31,
      "context" : "[35] found using the \"Reader View\" mode in Firefox web browser, Session 4C: Neural Networks and Embedding SIGIR ’20, July 25–30, 2020, Virtual Event, China",
      "startOffset" : 0,
      "endOffset" : 4
    }, {
      "referenceID" : 22,
      "context" : "ADHD, a neurological diference that is characterized by difculty focusing, is a common comorbidity that occurs with dyslexia [26].",
      "startOffset" : 125,
      "endOffset" : 129
    }, {
      "referenceID" : 25,
      "context" : "In the general population, the gender ratio for dyslexia is typically near parity, or skewed slightly towards males [29].",
      "startOffset" : 116,
      "endOffset" : 120
    }, {
      "referenceID" : 23,
      "context" : "recruitment methods ś women are more likely to use social media, follow mailing lists [27], and be special education teachers [2], so may have been more likely to see our ads.",
      "startOffset" : 86,
      "endOffset" : 90
    }, {
      "referenceID" : 0,
      "context" : "recruitment methods ś women are more likely to use social media, follow mailing lists [27], and be special education teachers [2], so may have been more likely to see our ads.",
      "startOffset" : 126,
      "endOffset" : 129
    }, {
      "referenceID" : 14,
      "context" : "The experimenter then administered an oral version of the NASA-TLX (task load index), which was modifed to allow participants to respond on a 5-point (rather than 21-point) scale [18, 28].",
      "startOffset" : 179,
      "endOffset" : 187
    }, {
      "referenceID" : 24,
      "context" : "The experimenter then administered an oral version of the NASA-TLX (task load index), which was modifed to allow participants to respond on a 5-point (rather than 21-point) scale [18, 28].",
      "startOffset" : 179,
      "endOffset" : 187
    }, {
      "referenceID" : 12,
      "context" : ", tasks with an intent to acquire information present in one or more webpages), as opposed to transactional or navigational tasks [16].",
      "startOffset" : 130,
      "endOffset" : 134
    }, {
      "referenceID" : 14,
      "context" : "Of the two, Understand tasks are reported to be harder [18, 56].",
      "startOffset" : 55,
      "endOffset" : 63
    }, {
      "referenceID" : 52,
      "context" : "Of the two, Understand tasks are reported to be harder [18, 56].",
      "startOffset" : 55,
      "endOffset" : 63
    }, {
      "referenceID" : 16,
      "context" : "When developing tasks for this study, we chose a set that covered diverse domains to reduce efects of prior domain knowledge [20].",
      "startOffset" : 125,
      "endOffset" : 129
    }, {
      "referenceID" : 5,
      "context" : "spelling errors in query: including number of phonetic and typographic spelling errors, calculated using DamerauśLevenshtein edit distance [9] which is the minimum number of insertions, deletions, or substitutions of a single character required to change one query term into the correct term.",
      "startOffset" : 139,
      "endOffset" : 142
    }, {
      "referenceID" : 41,
      "context" : "Previous work [45, 47] has established that searchers examine webpages using the following patterns (see Figure 2):",
      "startOffset" : 14,
      "endOffset" : 22
    }, {
      "referenceID" : 43,
      "context" : "Previous work [45, 47] has established that searchers examine webpages using the following patterns (see Figure 2):",
      "startOffset" : 14,
      "endOffset" : 22
    }, {
      "referenceID" : 31,
      "context" : "has shown that people with dyslexia are slower when reading and composing text [35, 38, 39], so we hypothesized that SWD would take longer to complete search tasks than the control group.",
      "startOffset" : 79,
      "endOffset" : 91
    }, {
      "referenceID" : 34,
      "context" : "has shown that people with dyslexia are slower when reading and composing text [35, 38, 39], so we hypothesized that SWD would take longer to complete search tasks than the control group.",
      "startOffset" : 79,
      "endOffset" : 91
    }, {
      "referenceID" : 35,
      "context" : "has shown that people with dyslexia are slower when reading and composing text [35, 38, 39], so we hypothesized that SWD would take longer to complete search tasks than the control group.",
      "startOffset" : 79,
      "endOffset" : 91
    }, {
      "referenceID" : 6,
      "context" : "ing information [10, 38] together with their tendency to express lower levels of self-esteem and confdence when performing such tasks [6, 31, 43].",
      "startOffset" : 16,
      "endOffset" : 24
    }, {
      "referenceID" : 34,
      "context" : "ing information [10, 38] together with their tendency to express lower levels of self-esteem and confdence when performing such tasks [6, 31, 43].",
      "startOffset" : 16,
      "endOffset" : 24
    }, {
      "referenceID" : 4,
      "context" : "ing information [10, 38] together with their tendency to express lower levels of self-esteem and confdence when performing such tasks [6, 31, 43].",
      "startOffset" : 134,
      "endOffset" : 145
    }, {
      "referenceID" : 27,
      "context" : "ing information [10, 38] together with their tendency to express lower levels of self-esteem and confdence when performing such tasks [6, 31, 43].",
      "startOffset" : 134,
      "endOffset" : 145
    }, {
      "referenceID" : 39,
      "context" : "ing information [10, 38] together with their tendency to express lower levels of self-esteem and confdence when performing such tasks [6, 31, 43].",
      "startOffset" : 134,
      "endOffset" : 145
    }, {
      "referenceID" : 29,
      "context" : "Finally, we note that in contrast to prior work [33, 56], we did not fnd Remember tasks to be systematically easier, or harder, than Understand tasks ś there were no signifcant diferences in task completion time, nor were there signifcant diferences in reported task load.",
      "startOffset" : 48,
      "endOffset" : 56
    }, {
      "referenceID" : 52,
      "context" : "Finally, we note that in contrast to prior work [33, 56], we did not fnd Remember tasks to be systematically easier, or harder, than Understand tasks ś there were no signifcant diferences in task completion time, nor were there signifcant diferences in reported task load.",
      "startOffset" : 48,
      "endOffset" : 56
    }, {
      "referenceID" : 7,
      "context" : "We expected SWD would formulate more queries than the control group, as mentioned in previous studies [11, 19, 37].",
      "startOffset" : 102,
      "endOffset" : 114
    }, {
      "referenceID" : 15,
      "context" : "We expected SWD would formulate more queries than the control group, as mentioned in previous studies [11, 19, 37].",
      "startOffset" : 102,
      "endOffset" : 114
    }, {
      "referenceID" : 33,
      "context" : "We expected SWD would formulate more queries than the control group, as mentioned in previous studies [11, 19, 37].",
      "startOffset" : 102,
      "endOffset" : 114
    }, {
      "referenceID" : 7,
      "context" : "Likewise, we expected SWD to make more spelling errors when composing queries, as reported in [11, 37, 38].",
      "startOffset" : 94,
      "endOffset" : 106
    }, {
      "referenceID" : 33,
      "context" : "Likewise, we expected SWD to make more spelling errors when composing queries, as reported in [11, 37, 38].",
      "startOffset" : 94,
      "endOffset" : 106
    }, {
      "referenceID" : 34,
      "context" : "Likewise, we expected SWD to make more spelling errors when composing queries, as reported in [11, 37, 38].",
      "startOffset" : 94,
      "endOffset" : 106
    }, {
      "referenceID" : 14,
      "context" : "Since those with dyslexia have been shown to have trouble spelling because of challenges with phonological decoding [18, 38], we expected SWDs to make more phonetic errors than the control group.",
      "startOffset" : 116,
      "endOffset" : 124
    }, {
      "referenceID" : 34,
      "context" : "Since those with dyslexia have been shown to have trouble spelling because of challenges with phonological decoding [18, 38], we expected SWDs to make more phonetic errors than the control group.",
      "startOffset" : 116,
      "endOffset" : 124
    }, {
      "referenceID" : 41,
      "context" : ", based on titles), followed by more focused attention on one or more promising snippets [45, 47].",
      "startOffset" : 89,
      "endOffset" : 97
    }, {
      "referenceID" : 43,
      "context" : ", based on titles), followed by more focused attention on one or more promising snippets [45, 47].",
      "startOffset" : 89,
      "endOffset" : 97
    }, {
      "referenceID" : 33,
      "context" : "This result helps explain prior fndings reporting SWD struggle with search results triage [37, 43].",
      "startOffset" : 90,
      "endOffset" : 98
    }, {
      "referenceID" : 39,
      "context" : "This result helps explain prior fndings reporting SWD struggle with search results triage [37, 43].",
      "startOffset" : 90,
      "endOffset" : 98
    }, {
      "referenceID" : 21,
      "context" : "They might be scrolling further to fnd things that are more readable to them, as suggested by [25, 43].",
      "startOffset" : 94,
      "endOffset" : 102
    }, {
      "referenceID" : 39,
      "context" : "They might be scrolling further to fnd things that are more readable to them, as suggested by [25, 43].",
      "startOffset" : 94,
      "endOffset" : 102
    }, {
      "referenceID" : 4,
      "context" : "\" Concern with fnding additional support for an answer may refect a lack of confdence, as suggested by prior literature [6, 31, 43].",
      "startOffset" : 120,
      "endOffset" : 131
    }, {
      "referenceID" : 27,
      "context" : "\" Concern with fnding additional support for an answer may refect a lack of confdence, as suggested by prior literature [6, 31, 43].",
      "startOffset" : 120,
      "endOffset" : 131
    }, {
      "referenceID" : 39,
      "context" : "\" Concern with fnding additional support for an answer may refect a lack of confdence, as suggested by prior literature [6, 31, 43].",
      "startOffset" : 120,
      "endOffset" : 131
    }, {
      "referenceID" : 14,
      "context" : "SWD might re-visit and re-read information because dyslexia is associated with having a shorter working memory [7, 18, 38].",
      "startOffset" : 111,
      "endOffset" : 122
    }, {
      "referenceID" : 34,
      "context" : "SWD might re-visit and re-read information because dyslexia is associated with having a shorter working memory [7, 18, 38].",
      "startOffset" : 111,
      "endOffset" : 122
    }, {
      "referenceID" : 21,
      "context" : "We also expected SWD to pay more visual attention to bold fonts and images than the control group, because prior work relates these to higher readability scores and SWD prefer more readable documents [25, 35, 41]; however, we could not accept this hypothesis because we did not fnd any signifcant diferences at the = 0.",
      "startOffset" : 200,
      "endOffset" : 212
    }, {
      "referenceID" : 31,
      "context" : "We also expected SWD to pay more visual attention to bold fonts and images than the control group, because prior work relates these to higher readability scores and SWD prefer more readable documents [25, 35, 41]; however, we could not accept this hypothesis because we did not fnd any signifcant diferences at the = 0.",
      "startOffset" : 200,
      "endOffset" : 212
    }, {
      "referenceID" : 37,
      "context" : "We also expected SWD to pay more visual attention to bold fonts and images than the control group, because prior work relates these to higher readability scores and SWD prefer more readable documents [25, 35, 41]; however, we could not accept this hypothesis because we did not fnd any signifcant diferences at the = 0.",
      "startOffset" : 200,
      "endOffset" : 212
    }, {
      "referenceID" : 21,
      "context" : "These qualitative results are consistent with prior self-report results [25, 39, 43].",
      "startOffset" : 72,
      "endOffset" : 84
    }, {
      "referenceID" : 35,
      "context" : "These qualitative results are consistent with prior self-report results [25, 39, 43].",
      "startOffset" : 72,
      "endOffset" : 84
    }, {
      "referenceID" : 39,
      "context" : "These qualitative results are consistent with prior self-report results [25, 39, 43].",
      "startOffset" : 72,
      "endOffset" : 84
    }, {
      "referenceID" : 44,
      "context" : "in the context of word processing [48].",
      "startOffset" : 34,
      "endOffset" : 38
    }, {
      "referenceID" : 30,
      "context" : "Furthermore, since instant answers are usually sourced from Wikipedia, a source deemed trustworthy by SWD [34], these answers will reduce the challenge to triage trustworthiness by SWD and non-SWD alike [40].",
      "startOffset" : 106,
      "endOffset" : 110
    }, {
      "referenceID" : 36,
      "context" : "Furthermore, since instant answers are usually sourced from Wikipedia, a source deemed trustworthy by SWD [34], these answers will reduce the challenge to triage trustworthiness by SWD and non-SWD alike [40].",
      "startOffset" : 203,
      "endOffset" : 207
    }, {
      "referenceID" : 17,
      "context" : "These fndings bolster the need to redesign the search algorithm to re-rank results using readability and trustworthiness more heavily than it currently does [21, 51] and add to previous work [25, 35] that",
      "startOffset" : 157,
      "endOffset" : 165
    }, {
      "referenceID" : 47,
      "context" : "These fndings bolster the need to redesign the search algorithm to re-rank results using readability and trustworthiness more heavily than it currently does [21, 51] and add to previous work [25, 35] that",
      "startOffset" : 157,
      "endOffset" : 165
    }, {
      "referenceID" : 21,
      "context" : "These fndings bolster the need to redesign the search algorithm to re-rank results using readability and trustworthiness more heavily than it currently does [21, 51] and add to previous work [25, 35] that",
      "startOffset" : 191,
      "endOffset" : 199
    }, {
      "referenceID" : 31,
      "context" : "These fndings bolster the need to redesign the search algorithm to re-rank results using readability and trustworthiness more heavily than it currently does [21, 51] and add to previous work [25, 35] that",
      "startOffset" : 191,
      "endOffset" : 199
    }, {
      "referenceID" : 46,
      "context" : "trustworthiness and readability of a result, we could crowdsource trustworthiness and readability ratings for each result and present it to searchers as a visualization (like in [50]) or an icon (like in [12]).",
      "startOffset" : 178,
      "endOffset" : 182
    }, {
      "referenceID" : 8,
      "context" : "trustworthiness and readability of a result, we could crowdsource trustworthiness and readability ratings for each result and present it to searchers as a visualization (like in [50]) or an icon (like in [12]).",
      "startOffset" : 204,
      "endOffset" : 208
    }, {
      "referenceID" : 11,
      "context" : "interface and plugins could increase readability by automatically enlarging text as proposed by Bigham in [15], and to mitigate memory challenges faced by SWD preserve highlighted and zoomed sections.",
      "startOffset" : 106,
      "endOffset" : 110
    }, {
      "referenceID" : 45,
      "context" : "In future studies, when quick diagnostic tests of dyslexia (for example, [49]) become widely or clinically accepted or available in English language [8], we can control for individual diferences and better model related behaviors and strategies",
      "startOffset" : 73,
      "endOffset" : 77
    } ],
    "year" : 2020,
    "abstractText" : "Web search is a key digital literacy skill that can be particularly challenging for people with dyslexia, a common learning disability that afects reading and spelling skills in about 15% of the Englishspeaking population. In this paper, we collected and analyzed eyetracking, search log, and self-report data from 27 participants (14 with dyslexia) to confrm that searchers with dyslexia struggle with all stages of the search process and have markedly diferent gaze patterns and search behavior that refect the strategies used and challenges faced. Based on these fndings, we discuss design implications to improve the cognitive accessibility of web search.",
    "creator" : "LaTeX with acmart 2019/04/22 v1.60 Typesetting articles for the Association for Computing Machinery and hyperref 2018/11/30 v6.88e Hypertext links for LaTeX"
  }
}